tutorials/pimpleHFDIBFoam/immersedCylinderSmoke/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           pointVectorField;
    location        "0";
    object          pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 0 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    outlet
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    topWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
