tutorials/pimpleHFDIBFoam/immersedCylinderSmoke/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

libs
(
    "libfvMotionSolvers.so"
    "libmeshTools.so"
);

application     pimpleHFDIBFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
// Smoke test: 20 steps. Long enough to start the IB machinery, build the
// forcing field and take several PIMPLE steps; far too short for developed
// flow or any drag measurement.
endTime         0.02;

deltaT          0.001;

writeControl    timeStep;
writeInterval   20;

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   8;

runTimeModifiable true;

adjustTimeStep  no;
maxCo           1;
// ************************************************************************* //
